{
  "backend/main.mo": "Main actor implementing user profiles, notes, syllabus, questions, and PDFs with CRUD operations, access control via MixinAuthorization, blob storage via MixinStorage, and migration support for adding PDF functionality.",
  "backend/migration.mo": "Migration module that upgrades the actor state from OldActor (without PDFs) to NewActor (with PDFs) by initializing empty PDF storage and nextPDFId counter.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: admin PDF management interface, public PDF browsing interface, and React Query hooks for PDF CRUD operations with high confidence.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all frontend files including components, pages, hooks, and admin interfaces with descriptions of PDF management functionality.",
  "frontend/index.css": "Global Tailwind CSS styles with custom OKLCH color system defining light and dark theme variables for background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, title 'BCA Notes Website', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup for routes (notes, syllabus, PDFs, PYQ, admin), ThemeProvider, ProfileSetupModal for first-time users, and loading state during initialization.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen component displaying shield alert icon, error message for non-admin users, and button to return home.",
  "frontend/src/components/admin/NoteForm.tsx": "Form component for creating or editing notes with title, description, and content fields. Handles both create and update operations.",
  "frontend/src/components/admin/NotesManager.tsx": "Admin interface for managing notes with list view, create/edit/delete actions, and confirmation dialog for deletions.",
  "frontend/src/components/admin/PDFForm.tsx": "Form component for creating and editing PDF entries with file upload, subject selection, title, description fields, and validation for file type and size (max 10MB).",
  "frontend/src/components/admin/PDFManager.tsx": "Admin interface for managing PDFs with list view grouped by subject, upload/edit/delete actions, and confirmation dialogs for deletion.",
  "frontend/src/components/admin/PYQForm.tsx": "Form component for creating and editing previous year questions (PYQ) with fields for year, semester, subject, and question content.",
  "frontend/src/components/admin/PYQManager.tsx": "Admin interface for managing previous year questions with list view, create/edit/delete actions, and delete confirmation dialogs.",
  "frontend/src/components/admin/SyllabusForm.tsx": "Form component for creating and editing syllabus entries with semester, subject, dynamic topic list management, and course details fields.",
  "frontend/src/components/admin/SyllabusManager.tsx": "Admin component for managing syllabus entries with CRUD operations, displaying syllabuses in cards with semester badges, topics count, and delete confirmation dialog.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright year, BCA Hub branding, and 'Built with ❤️ using caffeine.ai' attribution with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Header component with BCA Hub branding, navigation menu (Notes, Syllabus, PDFs, PYQ, Admin for admins), active route highlighting, and LoginButton integration.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component providing consistent page structure with Header at top, main content area in middle, and Footer at bottom.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with loading states, error handling for already-authenticated users, and query cache clearing on logout.",
  "frontend/src/components/NoteCard.tsx": "Displays a note card with title, description, and a 'View Details' button. Applies hover effects and triggers onClick callback.",
  "frontend/src/components/NoteDetailModal.tsx": "Modal dialog that displays full note details including title, description, and scrollable content in a formatted view.",
  "frontend/src/components/PDFCard.tsx": "Card component for displaying PDF metadata with view and download buttons. Handles PDF blob creation and file operations.",
  "frontend/src/components/PDFFilters.tsx": "Filter component for PDFs with subject dropdown and clear filters button. Extracts unique subjects from PDF list.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for first-time user profile setup that collects user name and saves it via mutation hook.",
  "frontend/src/components/PYQFilters.tsx": "Filter component for previous year questions with year, semester, and subject dropdowns plus clear filters functionality.",
  "frontend/src/components/PYQList.tsx": "Displays questions grouped by year in descending order, showing semester and subject badges with question content in cards.",
  "frontend/src/components/SyllabusAccordion.tsx": "Accordion component displaying syllabus items grouped by semester, showing topics and course details for each subject.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor with authentication, initializing access control with admin token and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including user profiles, notes, syllabuses, questions, and PDFs with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom academic-themed color palette for both light and dark modes using CSS custom properties.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers wrapping the main App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page with tabbed interface for managing notes, syllabus, PDFs, and previous year questions, with admin access control.",
  "frontend/src/pages/NotesPage.tsx": "Public-facing notes page with search functionality, displaying note cards in a grid layout with authentication-gated access and detail modal.",
  "frontend/src/pages/PDFsPage.tsx": "Displays a filterable grid of PDF resources organized by subject, with authentication check and loading states. Shows login prompt for unauthenticated users.",
  "frontend/src/pages/PYQPage.tsx": "Renders previous year questions with filters for year, semester, and subject. Requires authentication and displays filtered question list or empty state.",
  "frontend/src/pages/SyllabusPage.tsx": "Shows BCA syllabus organized by semester using an accordion component. Includes semester filter buttons and authentication requirement.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extending colors (using OKLCH), fonts, container settings, border radius variables, and animation keyframes for accordion components.",
  "project_state.json": "Project metadata defining a BCA notes website with admin/user roles, password authentication, and features for managing notes, syllabus, PDFs, and previous year questions."
}